jliphard/wearable_nRF52_Firmware/main.c
    record_counter++;   
  }
  
  if (record_counter >= 16 )
  {
        flash_green();
        
        SEGGER_RTT_printf(0, "TH:%d VB:%d\r\n", heartbeat16, battery_level8);
        //NRF_LOG_HEXDUMP_DEBUG((uint8_t *)flash_page_buffer, 256);
        
        //flush to memory.... 
        FLASH_Page_Write( GLOB_datastart, flash_page_buffer );  
     
        //advance counter  
        GLOB_datastart++;
    
        //clear the buffer  
        memset(flash_page_buffer, 0, sizeof(flash_page_buffer));
        record_counter = 0; 
    }
  
};

void add_to_flash( uint16_t counter, uint8_t batt, uint8_t pressure, uint8_t temperature, uint8_t humidity )
{ 
    //NRF_LOG_INFO("Add_to_flash\r\n");
    memset(fb, 0, sizeof(fb));
    
    //timestamp
    fb[ 0] = (uint8_t) ( counter       & 0xff);
    fb[ 1] = (uint8_t) ((counter >> 8) & 0xff);
    
    fb[ 2] = batt;
    fb[ 3] = pressure;
    fb[ 4] = temperature;
    fb[ 5] = humidity;
    
    fb[ 6] = 1; 
    fb[ 7] = 1; 
    
    fb[ 8] = 1;
    fb[ 9] = 1;
    
    fb[10] = 1;
    fb[11] = 1;
    
    fb[12] = 1;
    fb[13] = 1;
    
    fb[14] = 1;
    fb[15] = 1;

    FLASH_Write_Record( fb );    
}

static void update_battery(void)
{            
    
    //Battery ADC conversion process
    //this will update Current_VBATT() via callback
    nrf_drv_saadc_sample(); 
    
    //convert to percent from voltage - 3.8V is full
    //battery_level8  = (uint8_t )(100.00 * (float)Current_VBATT()/380.00);
    
    //for debugging let's record the actual voltage
    battery_level8 = (uint8_t)(Current_VBATT() - 300);
 
    SEGGER_RTT_printf(0, "Battery: %d\n", battery_level8);
    
    /*
     
    //bluetooth update
    
    ret_code_t err_code = NRF_SUCCESS;  
    err_code = ble_bas_battery_level_update(&m_bas, battery_level);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
        APP_ERROR_HANDLER(err_code);
    } 
    */
}

uint8_t batt_cycle = 0;
 
static void update_fast(void)
{

    SEGGER_RTT_WriteString(0, "Update fast.\n");

    if ( batt_cycle > 3 ) 
    {
        update_battery();
        batt_cycle = 0;
    } else {
        batt_cycle++;
    };
    
    heartbeat16++;
        
    //Pressure, Temp, and Humidity
    BME280_Read_PTH(&resultPTH_1[0]);
    
    //bluetooth update
    BMP280P8 = (uint8_t)( (resultPTH_1[0]/  10.00) - 10000.0 ); //need to add 1000 to the pressure. 
    BMP280T8 = (uint8_t)( (resultPTH_1[1]/  10.00) - 200.0   ); //need to add 20 to the temp
    BMP280H8 = (uint8_t)( (resultPTH_1[2]/1000.00)           );
        
    //NRF_LOG_DEBUG("TO:%d\r\n",(uint16_t)(resultPTH_1[1]/10.00));
    //NRF_LOG_DEBUG("P:%d\r\n",BMP280P8);
    //NRF_LOG_DEBUG("T:%d\r\n",BMP280T8);
    //NRF_LOG_DEBUG("H:%d\r\n",BMP280H8);
    
    add_to_flash( heartbeat16, battery_level8, BMP280P8, BMP280T8, BMP280H8 );    
    
    /*
    ret_code_t err_code = NRF_SUCCESS;
    err_code = ble_hrs_heart_rate_measurement_send_3(&m_hrs, BMP280P, BMP280T, BMP280H);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
    */
}

static void timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    flash_green();
    update_fast();
}

int main(void)
{
    SEGGER_RTT_WriteString(0, "\n\n***********\n");
    
    bool erase_bonds;

    log_init();    
    RTC1_timer_init();
    leds_init();
    
    // Request LF clock - needed when softdevice is off
    lfclk_request();
    
    //buttons_leds_init(&erase_bonds);
    //ble_stack_init();
    //gap_params_init();
    //gatt_init();
    //advertising_init();
    //ble_services_init();
    //conn_params_init();
    //peer_manager_init();
    
    //ADC subsystem 
    ADC_init();
    //NRF_LOG_DEBUG("ADC_init()\r\n");
        
    //I2C bus. 
    I2C_init();
    //NRF_LOG_DEBUG("I2C_init\r\n");
    
    //BME280 init. 
    BME280_Turn_On();
    //NRF_LOG_DEBUG("BME_280_set_up\r\n");
    
    //Flash memory
    FLASH_Init();
    //NRF_LOG_DEBUG("FLASH_init\r\n");
    
    //NRF_LOG_DEBUG("F1\r\n");
    FLASH_Get_ID();
    nrf_delay_ms(500);
    
    //FLASH_Reset();    
    //FLASH_Erase();
    //NRF_LOG_DEBUG("FLASH: Erase\r\n");
    
    GLOB_datastart = FLASH_Get_First_Available_Location();
    SEGGER_RTT_printf(0, "First empty page: %d\r\n", GLOB_datastart);
    
    flash_red();
    
    /*
    uint16_t j = 0;
    for(j = 0; j < 190; j++) {  
        nrf_delay_ms(100);
        FLASH_Page_Read(j);
    };
    */
       
    RTC1_timer_start();
    //advertising_start(erase_bonds);
    
    while( 1 ) 
    {
 
    };
     
    /*
        __SEV();
        __WFE();
        __WFE();
        
        flash_green();
        nrf_delay_ms(000);
       
        NRF_LOG_DEBUG("TICK\r\n");
        NRF_LOG_FLUSH();
        
        flash_red();

        update_fast();
        
        if ( batt_cycle > 3 ) 
        {
            update_battery();
            batt_cycle = 0;
        } 
        else 
        {
            batt_cycle++;
        };
        
        nrf_delay_ms(1000);

        FLASH_uninit();

        for (;;)
        {
            if (NRF_LOG_PROCESS() == false)
            {
                power_manage();
            }
        }
    */
}
